The solid from the spatial element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public Solid GetGeometry()
  Visual Basic
Public Function GetGeometry As Solid
  Visual C++
public:
Solid^ GetGeometry()
 Return Value
 Requested solid.
 See Also
  SpatialElementGeometryResults Class
  Autodesk.Revit.DB Namespace